tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "nikitabobko/tap"
tap "charmbracelet/tap"

brew "stow"
brew "bat"
brew "curl"
brew "fzf"
brew "git"
brew "jq"
brew "ripgrep"
brew "starship"
brew "toilet"
brew "tree"
brew "tty-clock"
brew "unzip"
brew "wget"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "atuin"
brew "awscli"
brew "bottom"
brew "difftastic"
brew "eza"
brew "fd"
brew "gh"
brew "k3d"
brew "k9s"
brew "kubernetes-cli"
brew "mas"
brew "mise"
brew "neovim"
brew "rclone"
brew "tbls"
brew "vhs"
brew "zoxide"
brew "charmbracelet/tap/freeze"

cask "google-cloud-sdk"
cask "aerospace"
cask "font-hack-nerd-font"
cask "keyclu"
cask "orbstack"
cask "raycast"
cask "shottr"
cask "tableplus"
cask "tandem"
cask "visual-studio-code"
cask "wezterm"
cask "notion"
cask "applite"

vscode "4ops.terraform"
vscode "aaron-bond.better-comments"
vscode "albymor.increment-selection"
vscode "alexcvzz.vscode-sqlite"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "amodio.restore-editors"
vscode "arjun.swagger-viewer"
vscode "bajdzis.vscode-database"
vscode "be5invis.toml"
vscode "bierner.markdown-mermaid"
vscode "christian-kohler.path-intellisense"
vscode "chrmarti.regex"
vscode "circleci.circleci"
vscode "dart-code.dart-code"
vscode "davidhouchin.whitespace-plus"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "dotjoshjohnson.xml"
vscode "dvirtz.parquet-viewer"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "emeraldwalk.runonsave"
vscode "emilast.logfilehighlighter"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "foam.foam-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-complete-tag"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "gera2ld.markmap-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "ibm.output-colorizer"
vscode "idleberg.icon-fonts"
vscode "infracost.infracost"
vscode "innoverio.vscode-dbt-power-user"
vscode "ionutvmi.path-autocomplete"
vscode "irongeek.vscode-env"
vscode "janisdd.vscode-edit-csv"
vscode "kamikillerto.vscode-colorize"
vscode "kevinrose.vsc-python-indent"
vscode "kingwampy.raspberrypi-sync"
vscode "kukushi.pasteurl"
vscode "leodevbro.blockman"
vscode "mechatroner.rainbow-csv"
vscode "mongodb.mongodb-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.live-server"
vscode "ms-vscode.vscode-serial-monitor"
vscode "ms-vsliveshare.vsliveshare"
vscode "msysyamamoto.vscode-digdag"
vscode "mtxr.sqltools"
vscode "mushan.vscode-paste-image"
vscode "naumovs.color-highlight"
vscode "neilding.language-liquid"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "platformio.platformio-ide"
vscode "pomdtr.excalidraw-editor"
vscode "pranaygp.vscode-css-peek"
vscode "qwtel.sqlite-viewer"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "samuelcolvin.jinjahtml"
vscode "shardulm94.trailing-spaces"
vscode "shinichi-takii.sql-bigquery"
vscode "simonsiefke.svg-preview"
vscode "tldraw-org.tldraw-vscode"
vscode "trunk.io"
vscode "usernamehw.errorlens"
vscode "vincaslt.highlight-matching-tag"
vscode "wayou.vscode-todo-highlight"
vscode "wicked-labs.wvsc-serendipity"
vscode "zainchen.json"
vscode "zignd.html-css-class-completion"
