tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"

brew "stow"
brew "bat"
brew "curl"
brew "fzf"
brew "git"
brew "helm"
brew "htop"
brew "httpie"
brew "jq"
brew "neomutt"
brew "neovim", args: ["HEAD"]
brew "ninja"
brew "nodebrew"
brew "packer"
brew "pyenv"
brew "ripgrep"
brew "starship"
brew "toilet"
brew "tree"
brew "tty-clock"
brew "unzip"
brew "wget"
brew "zsh"
brew "zsh-completions"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"

cask "font-hack-nerd-font"
