# =============================================================================
# Homebrew Bundle - Brewfile
# =============================================================================

# Taps
tap "nikitabobko/tap"
tap "charmbracelet/tap"
tap "productdevbook/tap"
tap "tw93/tap"

# =============================================================================
# CLI Tools
# =============================================================================

# Shell & Terminal
brew "zsh"                         # Modern shell with powerful features
brew "zsh-completions"             # Additional completion definitions for Zsh
brew "zsh-fast-syntax-highlighting" # Fast syntax highlighting for Zsh
brew "zsh-autosuggestions"         # Fish-like autosuggestions for Zsh
brew "starship"                    # Cross-shell prompt with minimal config
brew "atuin"                       # Magical shell history with SQLite backend

# File Management & Navigation
brew "stow"                        # Symlink farm manager for dotfiles
brew "eza"                         # Modern replacement for ls
brew "bat"                         # Cat clone with syntax highlighting
brew "fd"                          # Simple, fast alternative to find
brew "ripgrep"                     # Fast recursive grep alternative
brew "tree"                        # Display directory tree structure
brew "zoxide"                      # Smarter cd command with frecency
brew "xan"                         # CSV manipulation tool

# Git & Version Control
brew "git"                         # Distributed version control system
brew "gh"                          # GitHub CLI
brew "git-delta"                   # Syntax-highlighting pager for git/diff
brew "difftastic"                  # Structural diff tool
brew "onefetch"                    # Git repository summary in terminal

# Network & HTTP
brew "curl"                        # HTTP client
brew "wget"                        # File retrieval utility

# JSON/YAML Processing
brew "jq"                          # JSON processor

# Container & Kubernetes
brew "k3d"                         # k3s in Docker - local Kubernetes
brew "k9s"                         # Kubernetes TUI manager
brew "kubernetes-cli"              # Kubernetes command-line tool (kubectl)

# Cloud
brew "awscli"                      # AWS command-line interface

# System Monitoring
brew "bottom"                      # Cross-platform graphical process/system monitor
brew "btop"                        # Resource monitor with rich UI
brew "glances"                     # System monitoring tool
brew "sniffnet"                    # Network traffic monitor

# Development Tools
brew "neovim"                      # Hyperextensible Vim-based text editor
brew "mise"                        # Polyglot runtime version manager (asdf successor)

# AI & LLM
brew "llama.cpp"                   # LLM inference in C/C++
brew "gemini-cli"                  # Google Gemini CLI

# Policy & Security
brew "conftest"                    # Test configuration files using OPA
brew "opa"                         # Open Policy Agent - policy engine
brew "zizmor"                      # GitHub Actions security linter

# Document & Typesetting
brew "typst"                       # Modern markup-based typesetting system
brew "tectonic"                    # Modernized LaTeX engine

# Database Tools
brew "tbls"                        # Database documentation generator

# Media & Recording
brew "imagemagick"                 # Image manipulation library (for image.nvim)
brew "vhs"                         # CLI tool for recording terminal GIFs
brew "charmbracelet/tap/freeze"    # Generate images of code and terminal output
brew "handbrake"                   # Video transcoder
brew "asciinema"                   # Terminal session recorder

# Utilities
brew "unzip"                       # Extraction utility for .zip files
brew "mas"                         # Mac App Store CLI
brew "mole"                        # macOS cleanup and optimization tool
brew "rclone"                      # Cloud storage sync tool
brew "toilet"                      # ASCII art text generator
brew "tty-clock"                   # Terminal clock
brew "neofetch"                    # System info display
brew "tailscale"                   # Zero-config VPN

# =============================================================================
# GUI Applications (Casks)
# =============================================================================

# Development
cask "cursor"                      # AI-powered code editor
cask "visual-studio-code"          # Microsoft code editor
cask "wezterm"                     # GPU-accelerated terminal emulator
cask "orbstack"                    # Fast Docker & Linux VM for macOS
cask "tableplus"                   # Database management GUI
cask "xcodes"                      # Xcode version manager

# Cloud & DevOps
cask "google-cloud-sdk"            # Google Cloud CLI and tools

# Productivity
cask "raycast"                     # Launcher and productivity tool
cask "notion"                      # All-in-one workspace
cask "slack"                       # Team communication
cask "meetingbar"                  # Calendar meetings in menu bar
cask "tandem"                      # Virtual office for remote teams

# Browsers
cask "helium-browser"              # Privacy-focused Chromium fork (ungoogled-chromium based)
cask "zen-browser"                 # Privacy-focused Firefox fork
cask "zen"                         # Minimal browser

# Media
cask "iina"                        # Modern media player for macOS
cask "makemkv"                     # DVD/Blu-ray to MKV converter
cask "kap"                         # Screen recorder with GIF export

# Utilities
cask "keyclu"                      # Keyboard shortcut cheatsheet
cask "portkiller"                  # Menu bar app to kill processes on ports
cask "shottr"                      # Screenshot tool with annotations
cask "the-unarchiver"              # Archive extraction tool
cask "applite"                     # Homebrew GUI for casks
cask "pearcleaner"                 # App uninstaller with cleanup
cask "jordanbaird-ice"             # Menu bar manager
cask "sol"                         # Launcher app

# System
cask "aerospace"                   # i3-like tiling window manager for macOS
cask "cloudflare-warp"             # Cloudflare VPN client
cask "flux"                        # Screen color temperature adjuster
cask "pronotes"                    # Note-taking app

# Fonts
cask "font-hack-nerd-font"         # Nerd Font patched Hack font

# AI
cask "claude-code"                 # Claude Code CLI by Anthropic

# Security & Privacy
cask "lulu"                        # Free open-source macOS firewall (Objective-See)
cask "signal"                      # E2E encrypted messaging
cask "standard-notes"              # E2E encrypted notes

# =============================================================================
# VS Code Extensions
# =============================================================================

# Terraform & Infrastructure
vscode "4ops.terraform"
vscode "hashicorp.terraform"

# Git & GitHub
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"

# Python
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "kevinrose.vsc-python-indent"
vscode "njpwerner.autodocstring"

# Web Development
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-complete-tag"
vscode "formulahendry.auto-rename-tag"
vscode "pranaygp.vscode-css-peek"
vscode "vincaslt.highlight-matching-tag"
vscode "zignd.html-css-class-completion"
vscode "ritwickdey.liveserver"
vscode "ms-vscode.live-server"

# Database & SQL
vscode "alexcvzz.vscode-sqlite"
vscode "bajdzis.vscode-database"
vscode "mtxr.sqltools"
vscode "qwtel.sqlite-viewer"
vscode "shinichi-takii.sql-bigquery"

# Docker & Kubernetes
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"

# API & REST
vscode "arjun.swagger-viewer"
vscode "rangav.vscode-thunder-client"

# Markdown & Documentation
vscode "bierner.markdown-mermaid"
vscode "foam.foam-vscode"
vscode "gera2ld.markmap-vscode"

# Data Formats
vscode "be5invis.toml"
vscode "redhat.vscode-yaml"
vscode "mechatroner.rainbow-csv"
vscode "irongeek.vscode-env"
vscode "samuelcolvin.jinjahtml"

# Code Quality & Visualization
vscode "aaron-bond.better-comments"
vscode "usernamehw.errorlens"
vscode "gruntfuggly.todo-tree"
vscode "wayou.vscode-todo-highlight"
vscode "oderwat.indent-rainbow"
vscode "shardulm94.trailing-spaces"
vscode "davidhouchin.whitespace-plus"

# Color & Theme
vscode "equinusocio.vsc-material-theme-icons"
vscode "kamikillerto.vscode-colorize"
vscode "naumovs.color-highlight"
vscode "wicked-labs.wvsc-serendipity"

# File & Path
vscode "christian-kohler.path-intellisense"
vscode "ionutvmi.path-autocomplete"

# Utilities
vscode "albymor.increment-selection"
vscode "amodio.restore-editors"
vscode "chrmarti.regex"
vscode "emeraldwalk.runonsave"
vscode "emilast.logfilehighlighter"
vscode "foxundermoon.shell-format"
vscode "ibm.output-colorizer"
vscode "kukushi.pasteurl"
vscode "mushan.vscode-paste-image"

# Cloud & AWS
vscode "amazonwebservices.aws-toolkit-vscode"

# dbt
vscode "innoverio.vscode-dbt-power-user"

# Icons & Fonts
vscode "idleberg.icon-fonts"

# Drawing & Diagrams
vscode "pomdtr.excalidraw-editor"
vscode "simonsiefke.svg-preview"
vscode "tldraw-org.tldraw-vscode"

# C/C++ & Embedded
vscode "ms-vscode.cpptools"
vscode "ms-vscode.vscode-serial-monitor"
vscode "platformio.platformio-ide"

# Collaboration
vscode "ms-vsliveshare.vsliveshare"

# Disabled
# vscode "leodevbro.blockman" # https://github.com/leodevbro/vscode-blockman/issues/141
